In [29]:
import sqlite3
import os
import pandas as pd
import requests

In [66]:
connection1 = sqlite3.connect("death_rate.db")
connection2 = sqlite3.connect("HBD.db")
connection3 = sqlite3.connect("obesity.db")

In [31]:
file1 = 'death_rate.txt'
file2 = 'HBD.txt'
file3 = 'obesity.txt'


DR = pd.read_csv(file1, sep='\t',engine = 'python', header=None)
HBD = pd.read_csv(file2, sep='\t',engine = 'python', header=None)
obesity = pd.read_csv(file3, sep='\t',engine = 'python', header=None)


DR.columns = ['country', 'deathrate', 'year']
HBD.columns = ['country', 'density', 'year']
obesity.columns = ['country', 'percent', 'year']

In [53]:
DR.to_sql('death_rate_SQL', connection1)
HBD.to_sql('HBD_SQL', connection2)
obesity.to_sql('obesity_SQL', connection3)

ValueError: Table 'death_rate_SQL' already exists.

## Se pueden reducir tablas (en este caso le quitamos la columna año)

In [50]:
sql_ord1 = 'SELECT country, deathrate FROM death_rate_SQL'
C_DR = pd.read_sql(sql_ord1, connection1)
sql_ord2 = 'SELECT country, density FROM HBD_SQL'
C_HBD = pd.read_sql(sql_ord2, connection2)
sql_ord3 = 'SELECT country, percent FROM obesity_SQL'
C_obesity = pd.read_sql(sql_ord3, connection3)

In [34]:
C_DR

                  country  deathrate
0                 Lesotho         15
1               Lithuania         15
2                  Latvia         15
3                Bulgaria         15
4                 Ukraine         14
..                    ...        ...
192          Saudi Arabia          3
193               Bahrain          3
194                Kuwait          2
195  United Arab Emirates          2
196                 Qatar          2

[197 rows x 2 columns]

In [35]:
C_HBD

          country  density
0          Monaco       14
1           Japan       13
2    Korea, North       13
3    Korea, South       12
4         Belarus       11
..            ...      ...
167        Guinea        0
168      Ethiopia        0
169          Iran        0
170    Madagascar        0
171          Mali        0

[172 rows x 2 columns]

In [51]:
C_obesity

        country  percent
0         Nauru       61
1         Palau       55
2        Tuvalu       52
3         Tonga       48
4         Samoa       47
..          ...      ...
180       India        4
181    Cambodia        4
182  East Timor        4
183  Bangladesh        4
184     Vietnam        2

[185 rows x 2 columns]

## Paises con mayor taza de muertes

In [37]:
sql_ord1 = 'SELECT * FROM death_rate_SQL WHERE deathrate> 13'
mayores_DR = pd.read_sql(sql_ord1, connection1)
mayores_DR

   index    country  deathrate  year
0      0    Lesotho         15  2018
1      1  Lithuania         15  2018
2      2     Latvia         15  2018
3      3   Bulgaria         15  2018
4      4    Ukraine         14  2018
5      5     Serbia         14  2018

obtener cuantos valores tiene la tabla

In [60]:

sql_ord3 = 'SELECT count(country) FROM obesity_SQL'
Contar_valores = pd.read_sql(sql_ord3, connection3)
a = Contar_valores['count(country)']

In [61]:
sql_ord3 = 'SELECT count(case when percent > 30 then 1 end) FROM obesity_SQL'
Contar_porcentaje = pd.read_sql(sql_ord3, connection3)
b = Contar_porcentaje['count(case when percent > 30 then 1 end)']

## Porcentaje de paises con obesidad mayor a 30%

In [62]:
100*b/a

0    9.72973
dtype: float64

In [67]:

sql_ord2 = 'SELECT count(country) FROM HBD_SQL'
Contar_valores = pd.read_sql(sql_ord2, connection2)
a = Contar_valores['count(country)']

In [69]:
sql_ord2 = 'SELECT count(case when density < 5 then 1 end) FROM HBD_SQL'
Contar_porcentaje = pd.read_sql(sql_ord2, connection2)
b = Contar_porcentaje['count(case when density < 5 then 1 end)']

## Porcentaje de países cuya saturación de camas es menor a 5%

In [70]:
100*b/a

0    73.837209
dtype: float64